## Project 1

#### Prerequisites: Import Libraries

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [2]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123!"
mysql_hostname = "127.0.0.1"

atlas_cluster_name = "DS2002.fymrynp"
atlas_user_name = "rhiannonstaley"
atlas_password = "Awesomeuva25!"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila_rental"
dst_dbname = "sakila_dw2"
th_dbname = "sakila"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://rhiannonstaley:Awesomeuva25!@DS2002.fymrynp.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [3]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Create the New Data Warehouse database, and to Use it, Switch the Connection Context.

In [4]:
conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{mysql_hostname}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

#### Populate MongoDB with Source Data

In [5]:
client = pymongo.MongoClient(f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net")
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd())

json_files = {"rentals": "sakila_rental.json"}

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### Create & Populate the Dimension Tables

#### Extract Data from the Source Database Tables

In [6]:
#MySQL Dim Date Table
sql_date = "SELECT * FROM sakila_dw.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_date)
df_dim_date.head(2)

,date_key,full_date,date_name,date_name_us,date_name_eu,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,...,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
0,20000101,2000-01-01,2000/01/01,01/01/2000,01/01/2000,7,Saturday,1,1,Weekend,...,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3
1,20000102,2000-01-02,2000/01/02,01/02/2000,02/01/2000,1,Sunday,2,2,Weekend,...,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3

In [7]:
#MySQL Table
sql_film = "SELECT * FROM sakila.film;"
df_film = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, th_dbname, sql_film)
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [8]:
#MySQL Table
sql_film_actors = "SELECT * FROM sakila.film_actor;"
df_actors = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, th_dbname, sql_film_actors)
df_actors.head(2)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03

In [9]:
#MySQL Table
sql_film_category = "SELECT * FROM sakila.film_category;"
df_category = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, th_dbname, sql_film_category)
df_category.head(2)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09

In [10]:
#MySQL Table
sql_language = "SELECT * FROM sakila.language;"
df_language = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, th_dbname, sql_language)
df_language.head(2)

   language_id     name         last_update
0            1  English 2006-02-15 05:02:19
1            2  Italian 2006-02-15 05:02:19

In [11]:
#MongoDB Table
query = {} 
collection = "rentals"

df_rentals = get_mongo_dataframe(f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net", src_dbname, collection, query)
df_rentals.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [12]:
#HardDrive Table
df_payment = pd.read_json('/Users/rhiannonstaley/Downloads/sakila_payment.json')
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

### Create and Populate New Fact Table

In [13]:
sql_fact_orders = """
SELECT r.rental_id,
p.payment_id,
r.rental_date,
r.inventory_id,
r.customer_id,
r.staff_id,
r.last_update,
p.amount,
p.payment_date
FROM sakila.rental AS r
INNER JOIN sakila.payment AS p
ON r.rental_id = p.rental_id; """

df_fact_orders = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, th_dbname, sql_fact_orders)
df_fact_orders

,rental_id,payment_id,rental_date,inventory_id,customer_id,staff_id,last_update,amount,payment_date
0,1,3504,2005-05-24 22:53:30,367,130,1,2006-02-15 21:30:53,2.99,2005-05-24 22:53:30
1,2,12377,2005-05-24 22:54:33,1525,459,1,2006-02-15 21:30:53,2.99,2005-05-24 22:54:33
2,3,11032,2005-05-24 23:03:39,1711,408,1,2006-02-15 21:30:53,3.99,2005-05-24 23:03:39
3,4,8987,2005-05-24 23:04:41,2452,333,2,2006-02-15 21:30:53,4.99,2005-05-24 23:04:41
4,5,6003,2005-05-24 23:05:21,2079,222,1,2006-02-15 21:30:53,6.99,2005-05-24 23:05:21
...,...,...,...,...,...,...,...,...,...
16039,16045,384,2005-08-23 22:25:26,772,14,1,2006-02-15 21:30:53,0.99,2005-08-23 22:25:26
16040,16046,2020,2005-08-23 22:26:47,4364,74,2,2006-02-15 21:30:53,0.99,2005-08-23 22:26:47
16041,16047,3089,2005-08-23 22:42:48,2088,114,2,2006-02-15 21:30:53,0.99,2005-08-23 22:42:48
16042,16048,2799,2005-08-23 22:43:07,2019,103,1,2006-02-15 21:30:53,8.99,2005-08-23 22:43:07
16043,16049,10671,2005-08-23 22:50:12,2666,393,2,2006-02-15 21:30:53,3.99,2005-08-23 22:50:12

#### Perform Any Necessary Transformations

In [14]:
drop_cols = ['description', 'original_language_id', 'replacement_cost', 'special_features']
df_film.drop(drop_cols, axis=1, inplace=True)
df_film.rename(columns={"film_id":"film_key"}, inplace=True)

df_film.head(2)

,film_key,title,release_year,language_id,rental_duration,rental_rate,length,rating,last_update
0,1,ACADEMY DINOSAUR,2006,1,6,0.99,86,PG,2006-02-15 05:03:42
1,2,ACE GOLDFINGER,2006,1,3,4.99,48,G,2006-02-15 05:03:42

In [15]:
df_actors.rename(columns={"actor_id":"actor_key", "film_id":"film_key"}, inplace=True)
df_actors = df_actors.drop_duplicates(subset=["actor_key"])
df_actors.head(2)

    actor_key  film_key         last_update
0           1         1 2006-02-15 05:05:03
19          2         3 2006-02-15 05:05:03

In [16]:
df_category.rename(columns={"category_id":"category_key"}, inplace=True)
df_category = df_category.drop_duplicates(subset=["category_key"])
df_category.head(2)

   film_id  category_key         last_update
0        1             6 2006-02-15 05:07:09
1        2            11 2006-02-15 05:07:09

In [17]:
df_language.rename(columns={"language_id":"language_key"}, inplace=True)
df_language.head(2)

   language_key     name         last_update
0             1  English 2006-02-15 05:02:19
1             2  Italian 2006-02-15 05:02:19

In [18]:
drop_cols = ['staff_id']
df_rentals.drop(drop_cols, axis=1, inplace=True)
df_rentals.rename(columns={"rental_id":"rental_key"}, inplace=True)

df_rentals.head(2)

,rental_key,rental_date,inventory_id,customer_id,return_date,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,2006-02-15 21:30:53

In [19]:
drop_cols = ['staff_id']
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.rename(columns={"payment_id":"payment_key"}, inplace=True)

df_payment.head(2)

,payment_key,customer_id,rental_id,amount,payment_date,last_update
0,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

#### Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

In [20]:
db_operation = "insert"

tables = [('dim_film', df_film, 'film_key'),
          ('dim_date', df_dim_date, 'date_key'),
          ('dim_film_actor', df_actors, 'actor_key'),
          ('dim_film_category', df_category, 'category_key'),
          ('dim_language', df_language, 'language_key'),
          ('dim_payment', df_payment, 'payment_key'),
          ('dim_rental', df_rentals, 'rental_key'),
          ('fact_order', df_fact_orders, 'rental_id')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### Validate that the New Dimension Tables were Created

In [21]:
sql_dim_date2 = "SELECT * FROM sakila_dw2.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_date2)
df_dim_date.head(2)

,date_key,full_date,date_name,date_name_us,date_name_eu,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,...,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
0,20000101,2000-01-01,2000/01/01,01/01/2000,01/01/2000,7,Saturday,1,1,Weekend,...,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3
1,20000102,2000-01-02,2000/01/02,01/02/2000,02/01/2000,1,Sunday,2,2,Weekend,...,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3

In [22]:
sql_film2 = "SELECT * FROM sakila_dw2.dim_film;"
df_dim_film = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_film2)
df_dim_film.head(2)

,film_key,title,release_year,language_id,rental_duration,rental_rate,length,rating,last_update
0,1,ACADEMY DINOSAUR,2006,1,6,0.99,86,PG,2006-02-15 05:03:42
1,2,ACE GOLDFINGER,2006,1,3,4.99,48,G,2006-02-15 05:03:42

In [23]:
sql_payment2 = "SELECT * FROM sakila_dw2.dim_payment;"
df_dim_payment = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_payment2)
df_dim_payment.head(2)

,payment_key,customer_id,rental_id,amount,payment_date,last_update
0,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [24]:
sql_rentals2 = "SELECT * FROM sakila_dw2.dim_rental"
df_dim_rental = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_rentals2)
df_dim_rental.head(2)

,rental_key,rental_date,inventory_id,customer_id,return_date,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,2006-02-15 21:30:53

#### Validate that the Fact Table Was Created

In [26]:
sql_fact_orders2 = "SELECT * FROM sakila_dw2.fact_order"
df_fact_order = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_fact_orders2)
df_fact_order.head(2)

,rental_id,payment_id,rental_date,inventory_id,customer_id,staff_id,last_update,amount,payment_date
0,1,3504,2005-05-24 22:53:30,367,130,1,2006-02-15 21:30:53,2.99,2005-05-24 22:53:30
1,2,12377,2005-05-24 22:54:33,1525,459,1,2006-02-15 21:30:53,2.99,2005-05-24 22:54:33

### Author a Query that Returns the Total Spent Over Time per Customer ID

In [28]:
sql_test2 = """
    SELECT rental.`customer_id` AS `Customer`,
        SUM(payment.`amount`) AS `Total Price Over Time`
    FROM `{0}`.`fact_order` AS payment
    INNER JOIN `{0}`.dim_rental AS rental
    ON payment.rental_date = rental.rental_date
    GROUP BY rental.`customer_id`
    ORDER BY `Total Price Over Time` DESC;
    """.format(dst_dbname)

df_test = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, th_dbname, sql_test2)
df_test

     Customer  Total Price Over Time
0         245                  28.94
1         105                  26.96
2         429                  26.95
3          19                  26.94
4         246                  25.96
..        ...                    ...
480       122                   0.99
481       406                   0.99
482        99                   0.99
483        52                   0.99
484       367                   0.99

[485 rows x 2 columns]